SPedt/src/Documents/Расходная/Расходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расходная</name>
  <registerRecords>InformationRegister.ОбменССайтом</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискНикаСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоплатаОрганизатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоплатаУчастник</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыдачи</name>
    <type>
      <types>EnumRef.СтатусыВыдачиПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартаУчастника</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусККМ</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробитЧекОтмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Потерян</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСпр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплатить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныхДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетОрганизатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетУчастник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплаченоУчастником</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/CommonModules/СП_РаботаСДокументами_Клиент/Module.bsl
Процедура ПриОткрытии(ЭтотОбъект) Экспорт
	//Если 		ЭтотОбъект.Объект.Ссылка.Проведен	и
	//		не 	РольДоступна("СП_КорректеровкаПроведенных") Тогда
	//	ЭтотОбъект.ТолькоПросмотр = истина;
	//	ПоказатьПредупреждение(, "Редактирование проведенных документов запрещено. Обратитесь к Администратору!",,);
	//КонецЕсли;		
			
КонецПроцедуры	

Процедура 	ПроверитьОтветственного(ЭтотОбъект, Отказ) Экспорт
	Если ЭтотОбъект.Объект.Свойство("Ответственный") Тогда
		Если аСПСлужебные.ПроверятьОтветственного() и  не ЗначениеЗаполнено(ЭтотОбъект.Объект.Ответственный) Тогда
			Сообщить("Необходимо установить ответственного за выдачу!!!");
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

Функция 	ЗаписатьДокумент(УФ_Документа, ПараметрыЗаписи =  Неопределено, Ответственный = Неопределено)Экспорт
	Если Ответственный <> Неопределено Тогда
		УФ_Документа.Объект.Ответственный	=	Ответственный;
	КонецЕсли;
	Если ПараметрыЗаписи =  Неопределено Тогда
		ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения",
											РежимЗаписиДокумента.Проведение,
											РежимПроведенияДокумента.Оперативный);
	КонецЕсли;
	Попытка
		записан	= УФ_Документа.Записать(ПараметрыЗаписи);
		ОповеститьОбИзменении(УФ_Документа.Объект.Ссылка);
		Если не Записан Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не записан");
		КонецЕсли;
		Возврат записан;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не записан" + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Процедура ОткрытьФорму_Расходная(ПараметрыКарты)  Экспорт
	Если   аСППрверкиКлиент.НаличиеОткрытыхОкон("Расходная") Тогда
    	Предупреждение("Существует не завершенная операция ВЫДАЧИ.Закройте все окна РАСХОДА и повторите попытку!!!",30,"Предупреждение");
		Возврат;		
	КонецЕсли;
	
	//Окна = ПолучитьОкна();
	//Для каждого элем из Окна Цикл
	//	Если элем.НачальнаяСтраница	Тогда
	//		ОкноРабочийСтол = элем;	
	//	КонецЕсли;	
	//КонецЦикла;
	//
	//ОповещениеПослеЗакрытия = новый ОписаниеОповещения("ПослеЗакрытияФормы",СП_РаботаСДокументами_Клиент);
	//ОткрытьФорму("Документ.Расходная.Форма.ФормаДокумента",ПараметрыКарты,ОкноРабочийСтол ,,,,ОповещениеПослеЗакрытия);
	
	
	форма=ПолучитьФорму("Документ.Расходная.ФормаОбъекта",ПараметрыКарты,,Истина);
	//ДанныеФормы = Форма.Объект;
	//
	//СП_РаботаСДокументами.ЗаполнитьФорму(ДанныеФормы,ПараметрыКарты);
	//СП_РаботаСДокументами.ЗаполнитьФорму_Расходная_ОстаткамиТоваров(ДанныеФормы);
	//КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
КонецПроцедуры

Процедура ПослеЗакрытияФормы(Резцльтат,Дополнительныепараметры)  Экспорт
	// Окна = ПолучитьОкна();
	//Для каждого элем из Окна Цикл
	//	Если элем.НачальнаяСтраница	Тогда
	//		а=1;	
	//	КонецЕсли;	
	//КонецЦикла;	
КонецПроцедуры

Процедура ОткрытьФорму_Приходная(ПараметрыЗаказа)  Экспорт
	Если   аСППрверкиКлиент.НаличиеОткрытыхОкон("Приходная") Тогда
    	Предупреждение("Существует не завершенная операция Поступления.Закройте все окна Прихода и повторите попытку!!!",30,"Предупреждение");
		Возврат;		
	КонецЕсли;
	
	Если ПараметрыЗаказа.Свойство("Посылка") Тогда
		Параметры = новый Структура("Транзит,ПунктВыдачи, Посылка ",ПараметрыЗаказа.Транзит,ПараметрыЗаказа.ПунктВыдачи, ПараметрыЗаказа.Посылка);
		
		ОткрытьФорму("Документ.Приходная.ФормаОбъекта",Параметры,,,,,,) ;

	Иначе
		форма		= ПолучитьФорму("Документ.Приходная.ФормаОбъекта");
		ДанныеФормы = Форма.Объект;
		СП_РаботаСДокументами.ЗаполнитьФорму(ДанныеФормы,новый Структура("Транзит,ПунктВыдачи ",ПараметрыЗаказа.Транзит,ПараметрыЗаказа.ПунктВыдачи));
		КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры


Процедура ОткрытьФорму_РазборКоробки(ПараметрыКоробки)  Экспорт
	Если   аСППрверкиКлиент.НаличиеОткрытыхОкон("Разбор") Тогда
    	Предупреждение("Существует не завершенная операция Разбора коробки .Закройте и повторите попытку!!!",30,"Предупреждение");
		Возврат;		
	КонецЕсли;

	форма		= ПолучитьФорму("Документ.РазборКоробки.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	Если ПараметрыКоробки.Свойство("Супергруппа") Тогда
		СП_РаботаСДокументами.ЗаполнитьФорму(ДанныеФормы,новый Структура("Супергруппа",ПараметрыКоробки.Супергруппа));
	Иначе	
		СП_РаботаСДокументами.ЗаполнитьФорму(ДанныеФормы,новый Структура("Организатор, Коробки ",ПараметрыКоробки.Организатор, ПараметрыКоробки));
	КонецЕсли;	
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
	
КонецПроцедуры


Процедура ОткрытьФорму_Продажа(Параметры)  Экспорт
	Если   аСППрверкиКлиент.НаличиеОткрытыхОкон("Продажа") Тогда
    	Предупреждение("Существует не завершенная операция Продажи. Закройте и повторите попытку!!!",30,"Предупреждение");
		Возврат;		
	КонецЕсли;

	форма		= ПолучитьФорму("Документ.Продажа.ФормаОбъекта",Параметры);
	ДанныеФормы = Форма.Объект;
	СП_РаботаСДокументами.ЗаполнитьФорму(ДанныеФормы,новый Структура("Участник",Параметры.Участник));
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
	
КонецПроцедуры


Процедура ОткрытьКорректировкуПоступления(Ссылка, Владелец) Экспорт
	Если не ЗначениеЗаполнено(Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не записан");
		Возврат;
	КонецЕсли;
	ПараметрыЗаполнения= Новый Структура();
	ПараметрыЗаполнения.Вставить("ДатаОтчета", 		ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Партия", 			новый структура("ПравоеЗначение, Использование, ВидСравнения",Ссылка, Истина, ВидСравненияКомпоновкиДанных.Равно) );
	//		ПараметрыЗаполнения.Вставить("Партия", 			Объект.Ссылка);
	
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОткрытияДвижения",ЭтаФорма);
	
	ОткрытьФорму("Документ.Движение.ФормаОбъекта",Новый структура("ПараметрыЗаполнения",ПараметрыЗаполнения) ,Владелец,,,,  );
КонецПроцедуры


Процедура ОткрытьКорректировкуПоступленияТранзит(Ссылка, Владелец) Экспорт
		//ПунктВыдачи 		= Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
		ПараметрыЗаполнения	= Новый Структура();

		ПараметрыЗаполнения.Вставить("ДатаОтчета", 		КонецДня(ТекущаяДата()));
		ПараметрыЗаполнения.Вставить("Партия", 			новый структура("ПравоеЗначение, Использование, ВидСравнения",Ссылка, Истина, ВидСравненияКомпоновкиДанных.Равно) );
		
//    	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);
	
		ОткрытьФорму("Документ.ДвижениеТранзита.ФормаОбъекта",Новый структура("ПараметрыЗаполнения",ПараметрыЗаполнения) ,Владелец,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс  );

КонецПроцедуры
